In [4]:
import pandas as pd
import numpy as np

In [2]:
sal=pd.read_csv("Salaries.csv")

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [7]:
labels=['a','b','c']
mylist=[10,20,30]

In [8]:
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [10]:
sal[sal.isnull()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
148650,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
148651,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
148652,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
148653,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
arr=[10,20,30]
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [12]:
d={"a":10,"b":20,"c":30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
se1=pd.Series([1,2,3,4],["USA","Germany","Russia","India"])

In [15]:
se2=pd.Series([1,2,3,4],["USA","Russia","India","Japan"])

In [16]:
se1+se2

Germany    NaN
India      7.0
Japan      NaN
Russia     5.0
USA        2.0
dtype: float64

### randn->normal distribution

In [20]:
from numpy.random import randn
np.random.seed(101)

In [23]:
df=pd.DataFrame(randn(5,4),index=["A","B","C","D","E"],columns='W X Y Z'.split())

In [24]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [25]:
df['W'].dtype

dtype('float64')

In [29]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [30]:
df['New']=df['W']+df["X"]

In [32]:
df.head()

          W         X         Y         Z       New
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [33]:
df.drop("New",axis=1)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [34]:
df.drop("A",axis=0)

          W         X         Y         Z       New
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [35]:
df

          W         X         Y         Z       New
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [36]:
df.drop("New",axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [39]:
df.drop("E",axis=0,inplace=True)

In [40]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [41]:
df.loc["A"]

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [47]:
df.iloc[0,]

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [49]:
df.iloc[1,2]

-0.031579143908112575

In [50]:
df.loc["B","Y"]

-0.031579143908112575

In [51]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [52]:
df[df>0]

          W       X         Y         Z
A       NaN  0.1968       NaN  0.000366
B  1.025984     NaN       NaN  0.649826
C  2.154846     NaN       NaN       NaN
D  0.147027     NaN  0.558769  1.024810

In [53]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True

In [54]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [55]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [61]:
df[df>0]["Y"]

A         NaN
B         NaN
C         NaN
D    0.558769
Name: Y, dtype: float64

In [62]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [65]:
df[df["W"]>0]["Y"]

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [66]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810

In [78]:
states=["CA","Ba","DA","fa"]
df["STATES"]=states

In [79]:
df

          W         X         Y         Z STATES
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     Ba
C  2.154846 -0.610259 -0.755325 -0.346419     DA
D  0.147027 -0.479448  0.558769  1.024810     fa

In [80]:
df.set_index("STATES")

               W         X         Y         Z
STATES
CA     -0.993263  0.196800 -1.136645  0.000366
Ba      1.025984 -0.156598 -0.031579  0.649826
DA      2.154846 -0.610259 -0.755325 -0.346419
fa      0.147027 -0.479448  0.558769  1.024810

In [82]:
outside=["G1","G1","G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))

In [83]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [84]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [85]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [90]:
df=pd.DataFrame(np.random.randn(6,4),index=hier_index,columns=["A","B","C","D"])

In [91]:
df.head()

             A         B         C         D
G1 1  0.392489  0.221491 -0.855196  1.541990
   2  0.666319 -0.538235 -0.568581  1.407338
   3  0.641806 -0.905100 -0.391157  1.028293
G2 1 -1.972605 -0.866885  0.720788 -1.223082
   2  1.606780 -1.115710 -1.385379 -1.329660

In [92]:
df

             A         B         C         D
G1 1  0.392489  0.221491 -0.855196  1.541990
   2  0.666319 -0.538235 -0.568581  1.407338
   3  0.641806 -0.905100 -0.391157  1.028293
G2 1 -1.972605 -0.866885  0.720788 -1.223082
   2  1.606780 -1.115710 -1.385379 -1.329660
   3  0.041460 -0.411055 -0.771329  0.110477

In [93]:
df.loc["G1",1]

A    0.392489
B    0.221491
C   -0.855196
D    1.541990
Name: (G1, 1), dtype: float64

In [94]:
df.loc["G1"]

          A         B         C         D
1  0.392489  0.221491 -0.855196  1.541990
2  0.666319 -0.538235 -0.568581  1.407338
3  0.641806 -0.905100 -0.391157  1.028293

In [95]:
df.loc["G2"].loc[2]

A    1.606780
B   -1.115710
C   -1.385379
D   -1.329660
Name: 2, dtype: float64

In [96]:
df.index.names

FrozenList([None, None])

In [97]:
df.index.names=["Group","Number"]

In [98]:
df

                     A         B         C         D
Group Number
G1    1       0.392489  0.221491 -0.855196  1.541990
      2       0.666319 -0.538235 -0.568581  1.407338
      3       0.641806 -0.905100 -0.391157  1.028293
G2    1      -1.972605 -0.866885  0.720788 -1.223082
      2       1.606780 -1.115710 -1.385379 -1.329660
      3       0.041460 -0.411055 -0.771329  0.110477

In [100]:
df.index.names

FrozenList(['Group', 'Number'])

In [102]:
#crossscection
df.xs("G1")

               A         B         C         D
Number
1       0.392489  0.221491 -0.855196  1.541990
2       0.666319 -0.538235 -0.568581  1.407338
3       0.641806 -0.905100 -0.391157  1.028293

In [105]:
df.xs(1,level="Number")

              A         B         C         D
Group
G1     0.392489  0.221491 -0.855196  1.541990
G2    -1.972605 -0.866885  0.720788 -1.223082